# this file was used to generate the fuzzy vaults in vaults.py
# 合法用户及其简化的指纹信息
# 这些信息不应该明文存储，生成vault后就应该销毁这个文件

# people的数据类型属于“集合”，特点是无序、不包含重复元素
# 因为无序，所以访问时一般是用循环逐个读出
# people这个集合里的元素只是人名？那后面的列表是什么情况？
people = {
    "Jayme Woogerd": [0.22, 1.23, 2.342, 0.33, 1.27,
                      0.34, 2.32, 3.98, 1.254, 0.03],
    "Ming Chow": [0.32, 1.32, 2.452, 0.49, 1.43,
                  0.34, 2.52, 3.55, 1.233, 0.001],
    "Norman Ramsey": [0.45, 1.11, 2.321, 0.12, 1.11,
                      0.22, 2.91, 3.554, 1.33, 0.01]
}

